{
  "subject_title": "PRINCIPLES OF GENETICS",
  "topics": [
    {
      "id": 1,
      "title": "Pre and Post Mendelian concepts of heredity",
      "hindi": "आनुवंशिकता की प्री और पोस्ट मेंडेलियन अवधारणाएं",
      "content": "आनुवंशिकी के इतिहास को दो प्रमुख भागों में विभाजित किया जा सकता है। मेंडल से पहले (Pre-Mendelian), वैज्ञानिकों का मानना था कि माता-पिता के गुण तरल पदार्थ की तरह 'ब्लेंड' या मिश्रित हो जाते हैं। डार्विन की 'पेंजेनेसिस' थ्योरी के अनुसार शरीर के हर अंग से 'गेम्यूल्स' प्रजनन अंगों में एकत्र होते थे। हालाँकि, मेंडल के बाद (Post-Mendelian), यह स्थापित हुआ कि आनुवंशिकता कणों (जीन) के माध्यम से होती है जो अपनी स्वतंत्र पहचान बनाए रखते हैं। इसके बाद सटन और बोवेरी ने क्रोमोसोमल थ्योरी दी और मॉर्गन ने सहलग्नता की खोज की, जिससे आधुनिक आनुवंशिकी की नींव पड़ी। यह विषय हमें बताता है कि कैसे विज्ञान ने 'मिश्रण' के सिद्धांत को त्यागकर 'कणिका' (Particulate) सिद्धांत को अपनाया।",
      "points": [
        "ब्लेंडिंग इनहेरिटेंस बनाम पार्टिकुलेट इनहेरिटेंस",
        "पेंजेनेसिस और प्रीफॉर्मेशन थ्योरी का खंडन",
        "आधुनिक आनुवंशिकी का उदय"
      ],
      "diagram": ""
    },
    {
      "id": 2,
      "title": "Mendelian principles of heredity",
      "hindi": "आनुवंशिकता के मेंडेलियन सिद्धांत",
      "content": "ग्रेगर जोहान मेंडल ने मटर (Pisum sativum) पर अपने प्रयोगों के आधार पर तीन बुनियादी नियम दिए। 'प्रभाविता का नियम' कहता है कि संकर पीढ़ी में केवल प्रभावी लक्षण दिखाई देता है। 'पृथक्करण का नियम' बताता है कि युग्मक निर्माण के दौरान एलील्स अलग हो जाते हैं, जिससे युग्मक हमेशा शुद्ध रहते हैं। 'स्वतंत्र अपव्यूहन का नियम' स्पष्ट करता है कि विभिन्न लक्षणों के जीन एक-दूसरे से स्वतंत्र रूप से अगली पीढ़ी में जाते हैं। मेंडल का गणितीय दृष्टिकोण जीव विज्ञान में एक क्रांतिकारी कदम था, जिसने वंशानुक्रम के पैटर्न को समझना संभव बना दिया।",
      "points": [
        "Law of Dominance",
        "Law of Segregation (Purity of Gametes)",
        "Law of Independent Assortment"
      ],
      "diagram": ""
    },
    {
      "id": 3,
      "title": "Cell division – mitosis",
      "hindi": "कोशिका विभाजन - समसूत्री विभाजन",
      "content": "समसूत्री विभाजन कायिक कोशिकाओं (Somatic cells) में होता है। इसे 'समान विभाजन' कहा जाता है क्योंकि इसमें संतति कोशिकाओं में गुणसूत्रों की संख्या मातृ कोशिका के बराबर रहती है। इसकी चार मुख्य अवस्थाएँ हैं: प्रोफेज (गुणसूत्रों का संघनन), मेटाफेज (मध्य रेखा पर संरेखण), एनाफेज (सिस्टर क्रोमैटिड्स का अलग होना) और टेलोफेज (नए केंद्रक का निर्माण)। यह प्रक्रिया शरीर की वृद्धि, विकास और ऊतकों की मरम्मत के लिए अत्यंत महत्वपूर्ण है।",
      "points": [
        "Equational division (2n to 2n)",
        "शारीरिक वृद्धि में भूमिका",
        "चार चरणों की विस्तृत प्रक्रिया"
      ],
      "diagram": "[attachment_0](attachment)"
    },
    {
      "id": 4,
      "title": "Cell division – meiosis",
      "hindi": "कोशिका विभाजन - अर्धसूत्री विभाजन",
      "content": "अर्धसूत्री विभाजन जनन कोशिकाओं में होता है और गुणसूत्रों की संख्या को आधा (2n से n) कर देता है। इसके दो मुख्य चरण हैं: मियोसिस I और मियोसिस II। मियोसिस I की प्रोफेज-I अवस्था में 'क्रॉसिंग ओवर' होता है, जो आनुवंशिक विविधता का मुख्य कारण है। यह प्रक्रिया प्रजातियों में पीढ़ी-दर-पीढ़ी गुणसूत्रों की संख्या को स्थिर बनाए रखने और नए लक्षणों के संयोजन बनाने में मदद करती है।",
      "points": [
        "Reductional division (2n to n)",
        "Crossing Over और विविधता",
        "युग्मक (Gametes) का निर्माण"
      ],
      "diagram": ""
    },
    {
      "id": 5,
      "title": "Probability and Chi-square",
      "hindi": "प्रायिकता और काई-स्क्वायर",
      "content": "आनुवंशिकी में परिणामों की भविष्यवाणी के लिए प्रायिकता के नियमों (योग और गुणन नियम) का उपयोग किया जाता है। काई-स्क्वायर ($ \chi^2 $) परीक्षण एक सांख्यिकीय विधि है जो यह निर्धारित करती है कि प्रायोगिक परिणाम (Observed) और मेंडेलियन अपेक्षित अनुपात (Expected) के बीच का अंतर सार्थक है या केवल संयोग। यह वैज्ञानिकों को उनके आनुवंशिक परिकल्पनाओं की पुष्टि करने में मदद करता है।",
      "points": [
        "Probability rules in genetics",
        "Chi-square formula and degree of freedom",
        "Null hypothesis testing"
      ],
      "diagram": ""
    },
    {
      "id": 6,
      "title": "Dominance relationships and gene interaction",
      "hindi": "प्रभाविता संबंध और जीन अंतःक्रिया",
      "content": "सभी जीन मेंडल के पूर्ण प्रभाविता नियम का पालन नहीं करते। अपूर्ण प्रभाविता (Incomplete Dominance) में मध्यवर्ती लक्षण (जैसे मिराबिलिस में गुलाबी फूल) दिखाई देते हैं। सह-प्रभाविता (Co-dominance) में दोनों एलील्स समान रूप से व्यक्त होते हैं (जैसे AB रक्त समूह)। जीन अंतःक्रिया तब होती है जब दो या दो से अधिक जीन मिलकर एक ही लक्षण को प्रभावित करते हैं, जिससे मेंडल के सामान्य अनुपात बदल जाते हैं।",
      "points": [
        "Incomplete dominance vs Co-dominance",
        "Allelic vs Non-allelic interactions",
        "Lethal genes (घातक जीन)"
      ],
      "diagram": "[attachment_1](attachment)"
    },
    {
      "id": 7,
      "title": "Epistatic gene interactions I",
      "hindi": "एपिस्टैटिक जीन अंतःक्रिया I",
      "content": "एपिस्टैसिस वह प्रक्रिया है जिसमें एक जीन का एलील दूसरे जीन के प्रभाव को छिपा देता है या बदल देता है। इसमें पूरक जीन (Complementary genes - 9:7), अनुपूरक जीन (Supplementary genes - 9:3:4) और डुप्लिकेट जीन (Duplicate genes - 15:1) शामिल हैं। ये अंतःक्रियाएं दर्शाती हैं कि लक्षण विकास एक जटिल बहु-चरणीय जैव रासायनिक प्रक्रिया है।",
      "points": [
        "Complementary gene action (9:7)",
        "Supplementary gene action (9:3:4)",
        "Dihybrid ratios का संशोधन"
      ],
      "diagram": ""
    },
    {
      "id": 8,
      "title": "Epistatic gene interactions II",
      "hindi": "एपिस्टैटिक जीन अंतःक्रिया II",
      "content": "इसमें मास्किंग एपिस्टैसिस (Masking - 12:3:1), निरोधात्मक जीन (Inhibitory genes - 13:3) और पॉलीमेरिक जीन क्रिया (Polymeric - 9:6:1) शामिल हैं। ये अंतःक्रियाएं पौधों के रंग, आकार और अन्य संरचनात्मक गुणों के विकास में महत्वपूर्ण भूमिका निभाती हैं। यह विषय जटिल आनुवंशिक पैटर्न को समझने के लिए आवश्यक है।",
      "points": [
        "Dominant Epistasis (12:3:1)",
        "Inhibitory Gene interaction (13:3)",
        "Polymeric Gene action (9:6:1)"
      ],
      "diagram": ""
    },
    {
      "id": 9,
      "title": "Pleiotropism, pseudoalleles, Multiple alleles and Blood group genetics",
      "hindi": "प्लियोट्रोपिज्म, स्यूडोएलील्स, बहु-युग्मविकल्पी और रक्त समूह",
      "content": "जब एक ही जीन कई अलग-अलग लक्षणों को प्रभावित करता है, तो उसे प्लियोट्रोपिज्म कहते हैं। बहु-युग्मविकल्पी (Multiple Alleles) में एक ही जीन के दो से अधिक रूप होते हैं, जैसे मानव ABO रक्त समूह। स्यूडोएलील्स वे जीन हैं जो बहुत करीब होते हैं और एक ही लक्षण को प्रभावित करते हैं लेकिन क्रॉसिंग ओवर द्वारा अलग हो सकते हैं।",
      "points": [
        "Single gene, multiple effects",
        "ABO blood group inheritance",
        "Concept of pseudoalleles"
      ],
      "diagram": ""
    },
    {
      "id": 10,
      "title": "Sex determination",
      "hindi": "लिंग निर्धारण",
      "content": "विभिन्न जीवों में लिंग निर्धारण के अलग-अलग तंत्र होते हैं। मनुष्यों में XY तंत्र (पुरुष हेटेरोगामेटिक), पक्षियों में ZW तंत्र (मादा हेटेरोगामेटिक) और कुछ कीटों में XO तंत्र पाया जाता है। इसके अलावा, मधुमक्खियों में अगुणित-द्विगुणित (Haplodiploid) तंत्र और कुछ सरीसृपों में पर्यावरणीय लिंग निर्धारण भी होता है।",
      "points": [
        "Chromosomal theory of sex determination",
        "XY, ZW, XO systems",
        "Genic balance theory (Bridges)"
      ],
      "diagram": ""
    },
    {
      "id": 11,
      "title": "Sex limited, sex influenced and sex linked traits",
      "hindi": "लिंग सीमित, लिंग प्रभावित और लिंग सहलग्न लक्षण",
      "content": "लिंग सहलग्न (Sex-linked) लक्षण वे हैं जिनके जीन X या Y गुणसूत्र पर होते हैं (जैसे हीमोफिलिया)। लिंग सीमित (Sex-limited) लक्षण केवल एक लिंग में दिखाई देते हैं (जैसे दुग्ध उत्पादन)। लिंग प्रभावित (Sex-influenced) लक्षण दोनों में होते हैं लेकिन एक लिंग में अधिक प्रबल होते हैं (जैसे मनुष्यों में गंजापन)।",
      "points": [
        "X-linked inheritance patterns",
        "Sex-limited vs Sex-influenced traits",
        "Hologenic and Holandric genes"
      ],
      "diagram": ""
    },
    {
      "id": 12,
      "title": "Sex linkage",
      "hindi": "लिंग सहलग्नता",
      "content": "लिंग सहलग्नता मुख्य रूप से X-गुणसूत्र पर स्थित जीनों के स्थानांतरण को संदर्भित करती है। इसमें 'क्रिस-क्रॉस' वंशागति देखी जाती है, जहाँ पिता से लक्षण पुत्री में और फिर पुत्री से नाती (Grandson) में जाते हैं। Y-लिंक्ड जीन (Holandric) केवल पिता से पुत्र में स्थानांतरित होते हैं। यह आनुवंशिक रोगों के अध्ययन में बहुत महत्वपूर्ण है।",
      "points": [
        "Criss-cross inheritance",
        "X-linked recessive disorders",
        "Y-linked traits"
      ],
      "diagram": ""
    },
    {
      "id": 13,
      "title": "Linkage and its estimation",
      "hindi": "सहलग्नता और उसका अनुमान",
      "content": "सहलग्नता वह प्रवृत्ति है जिसमें एक ही गुणसूत्र पर स्थित जीन एक साथ वंशागत होते हैं। मॉर्गन ने इसके 'कपलिंग' और 'रिपल्शन' चरणों की व्याख्या की। सहलग्नता की शक्ति जीनों के बीच की दूरी पर निर्भर करती है। इसका अनुमान परीक्षण संकरण (Test cross) द्वारा प्राप्त पुनर्संयोजन आवृत्ति (Recombination frequency) से लगाया जाता है।",
      "points": [
        "Discovery by Bateson, Punnett and Morgan",
        "Coupling and Repulsion phases",
        "Linkage mapping basics"
      ],
      "diagram": ""
    },
    {
      "id": 14,
      "title": "Crossing over: introduction & mechanisms",
      "hindi": "क्रॉसिंग ओवर: परिचय और तंत्र",
      "content": "अर्धसूत्री विभाजन (Pachytene अवस्था) के दौरान समजात गुणसूत्रों के गैर-सिस्टर क्रोमैटिड्स के बीच आनुवंशिक सामग्री का आदान-प्रदान क्रॉसिंग ओवर कहलाता है। यह कियास्मा (Chiasma) निर्माण के माध्यम से होता है। यह प्रक्रिया प्रजातियों में नए आनुवंशिक संयोजनों और विविधताओं के लिए जिम्मेदार है, जो जैव विकास का आधार है।",
      "points": [
        "Mechanism: Synapsis, Duplication, Exchange, Terminalization",
        "Chiasma formation",
        "आनुवंशिक विविधता में महत्व"
      ],
      "diagram": ""
    },
    {
      "id": 15,
      "title": "Chromosome mapping",
      "hindi": "गुणसूत्र मानचित्रण",
      "content": "गुणसूत्र मानचित्रण वह तकनीक है जिससे गुणसूत्र पर जीनों की सापेक्ष स्थिति और उनके बीच की दूरी का पता लगाया जाता है। यह क्रॉसिंग ओवर के प्रतिशत पर आधारित है (1% रिकॉम्बिनेशन = 1 सेंटीमॉर्गन)। इसके लिए 'थ्री-पॉइंट टेस्ट क्रॉस' का उपयोग किया जाता है ताकि जीनों का सही क्रम निर्धारित किया जा सके।",
      "points": [
        "Genetic distance in Centimorgans (cM)",
        "Three-point test cross",
        "Interference and Coincidence"
      ],
      "diagram": ""
    },
    {
      "id": 16,
      "title": "Structural changes in chromosome",
      "hindi": "गुणसूत्र में संरचनात्मक परिवर्तन",
      "content": "गुणसूत्र की संरचना में बदलाव को 'क्रोमोसोमल एबेरेशंस' कहते हैं। इसमें विलोपन (Deletion - हिस्सा गायब होना), दोहराव (Duplication - हिस्सा बढ़ना), व्युत्क्रमण (Inversion - 180° घूमना) और स्थानांतरण (Translocation - गैर-समजात गुणसूत्रों के बीच विनिमय) शामिल हैं। ये परिवर्तन अक्सर गंभीर आनुवंशिक विकारों या मृत्यु का कारण बनते हैं।",
      "points": [
        "Deletion, Duplication, Inversion, Translocation",
        "Phenotypic effects",
        "Role in evolution"
      ],
      "diagram": "[Image showing structural chromosomal abnormalities]"
    },
    {
      "id": 17,
      "title": "Numerical changes in chromosome",
      "hindi": "गुणसूत्र में संख्यात्मक परिवर्तन",
      "content": "गुणसूत्रों की संख्या में परिवर्तन दो प्रकार का होता है: एन्यूप्लोइडी (एक या दो गुणसूत्रों की कमी या अधिकता, जैसे 2n+1) और यूप्लोइडी (पूरे सेट का बढ़ना, जैसे 3n, 4n)। पॉलीप्लोइडी (बहुगुणिता) का उपयोग कृषि में बड़े फल और अनाज विकसित करने के लिए किया जाता है। मनुष्यों में डाउन सिंड्रोम (Trisomy 21) इसका प्रमुख उदाहरण है।",
      "points": [
        "Aneuploidy vs Euploidy",
        "Autopolyploidy and Allopolyploidy",
        "Evolution of Wheat and Cotton"
      ],
      "diagram": ""
    },
    {
      "id": 18,
      "title": "Mutation: introduction, characteristics & classification",
      "hindi": "उत्परिवर्तन: परिचय, विशेषताएं और वर्गीकरण",
      "content": "उत्परिवर्तन डीएनए अनुक्रम में होने वाला अचानक, वंशानुगत परिवर्तन है। ह्यूगो डी व्रीस ने इसे खोजा था। ये आमतौर पर हानिकारक और अप्रभावी होते हैं। इन्हें स्वतः (Spontaneous) और प्रेरित (Induced) में वर्गीकृत किया जा सकता है। ये आनुवंशिक विविधता का प्राथमिक स्रोत हैं और फसल सुधार के लिए 'म्यूटेशन ब्रीडिंग' में उपयोग किए जाते हैं।",
      "points": [
        "Sudden heritable change",
        "Somatic vs Germinal mutations",
        "Point and Frameshift mutations"
      ],
      "diagram": ""
    },
    {
      "id": 19,
      "title": "Mutagenic agents: physical and chemical mutagens",
      "hindi": "उत्परिवर्तजन कारक: भौतिक और रासायनिक म्यूटेंट",
      "content": "वे कारक जो उत्परिवर्तन की दर को बढ़ाते हैं, म्यूटाजेंस कहलाते हैं। भौतिक म्यूटेंट में आयनकारी विकिरण (X-rays, Gamma rays) और गैर-आयनकारी विकिरण (UV rays) शामिल हैं। रासायनिक म्यूटेंट में EMS, मस्टर्ड गैस और बेस एनालॉग्स शामिल हैं। इनका उपयोग कृषि में नई किस्मों के विकास के लिए किया जाता है।",
      "points": [
        "Ionizing and Non-ionizing radiations",
        "Alkylating agents and Base analogs",
        "Safety and application in breeding"
      ],
      "diagram": ""
    },
    {
      "id": 20,
      "title": "Induction of mutation & CIB technique",
      "hindi": "उत्परिवर्तन का प्रेरण और CIB तकनीक",
      "content": "उत्परिवर्तन को कृत्रिम रूप से प्रेरित करना 'म्यूटाजेनेसिस' कहलाता है। एच.जे. मुलर ने ड्रोसोफिला में X-किरणों द्वारा उत्परिवर्तन की खोज की थी। 'CIB तकनीक' ड्रोसोफिला के X-गुणसूत्र पर होने वाले घातक उत्परिवर्तन (Recessive Lethal Mutations) का पता लगाने की एक व्यवस्थित विधि है, जिसका उपयोग म्यूटेशन दर मापने में किया जाता है।",
      "points": [
        "H.J. Muller's contribution",
        "CIB method for lethal mutation detection",
        "Experimental induction of mutations"
      ],
      "diagram": ""
    },
    {
      "id": 21,
      "title": "Qualitative & Quantitative traits",
      "hindi": "गुणात्मक और मात्रात्मक लक्षण",
      "content": "गुणात्मक लक्षण (Qualitative) वे हैं जो स्पष्ट श्रेणियों में होते हैं (जैसे फूल का रंग) और एक या दो जीनों द्वारा नियंत्रित होते हैं। मात्रात्मक लक्षण (Quantitative) निरंतर भिन्नता दिखाते हैं (जैसे ऊंचाई, उपज) और कई जीनों (पॉलीजीन) द्वारा नियंत्रित होते हैं। इन पर पर्यावरण का प्रभाव बहुत अधिक होता है।",
      "points": [
        "Oligogenic vs Polygenic inheritance",
        "Discontinuous vs Continuous variation",
        "Environmental influence"
      ],
      "diagram": "[Image showing Qualitative vs Quantitative variation graph]"
    },
    {
      "id": 22,
      "title": "Multiple factor hypothesis",
      "hindi": "बहु-कारक परिकल्पना",
      "content": "निल्सन-एहले द्वारा प्रतिपादित यह परिकल्पना बताती है कि मात्रात्मक लक्षणों का नियंत्रण कई स्वतंत्र जीनों द्वारा होता है, जिनका प्रभाव 'योगात्मक' (Additive) होता है। उन्होंने गेहूँ के दाने के रंग पर प्रयोग करके दिखाया कि कैसे कई जीन मिलकर रंगों की एक पूरी श्रृंखला (निरंतर भिन्नता) पैदा करते हैं।",
      "points": [
        "Nilsson-Ehle's experiment on Wheat",
        "Additive gene effect",
        "Polygenic inheritance foundations"
      ],
      "diagram": ""
    },
    {
      "id": 23,
      "title": "Cytoplasmic inheritance",
      "hindi": "कोशिकाद्रव्यी वंशागति",
      "content": "जब लक्षण केंद्रक के बाहर स्थित डीएनए (माइटोकॉन्ड्रिया या क्लोरोप्लास्ट) द्वारा नियंत्रित होते हैं, तो इसे कोशिकाद्रव्यी वंशागति कहते हैं। यह मुख्य रूप से 'मातृ वंशागति' (Maternal) होती है क्योंकि युग्मनज का सारा कोशिका द्रव्य अंडे से आता है। इसका उदाहरण 'मिराबिलिस जलापा' में प्लास्टिड वंशागति और मक्के में 'नर बंध्यता' (CMS) है।",
      "points": [
        "Extra-nuclear inheritance",
        "Maternal effect",
        "Plastid and Mitochondrial DNA role"
      ],
      "diagram": ""
    },
    {
      "id": 24,
      "title": "Genetic disorders",
      "hindi": "आनुवंशिक विकार",
      "content": "आनुवंशिक विकार जीनों या गुणसूत्रों में त्रुटियों के कारण होते हैं। मेंडेलियन विकार (जैसे सिकल सेल एनीमिया, थैलेसेमिया) एकल जीन म्यूटेशन से होते हैं। गुणसूत्र विकार (जैसे डाउन सिंड्रोम, क्लिनफेल्टर सिंड्रोम) गुणसूत्रों की संख्या या संरचना में बदलाव से होते हैं। इनका निदान पेडिग्री एनालिसिस और कैरियोटाइपिंग द्वारा किया जाता है।",
      "points": [
        "Mendelian disorders vs Chromosomal disorders",
        "Pedigree analysis",
        "Genetic counseling"
      ],
      "diagram": ""
    }
  ]
}
