{
  "subject_title": "PRINCIPLES OF GENETICS",
  "topics": [
    {
      "id": 1,
      "title": "Pre and Post Mendelian concepts of heredity",
      "hindi": "आनुवंशिकता की प्री और पोस्ट मेंडेलियन अवधारणाएं",
      "content": "आनुवंशिकता का इतिहास मानव सभ्यता जितना ही पुराना है, लेकिन इसका वैज्ञानिक अध्ययन ग्रेगर मेंडल के समय से ही व्यवस्थित हुआ। मेंडल से पूर्व के काल में वैज्ञानिकों का मानना था कि माता-पिता के लक्षण किसी तरल पदार्थ की तरह आपस में मिल जाते हैं, जिसे ब्लेंडिंग इनहेरिटेंस कहा जाता था। उस दौरान हिप्पोक्रेट्स ने पेंजेनेसिस की थ्योरी दी थी जिसमें माना जाता था कि शरीर के हर हिस्से से छोटे कण जिन्हें गेम्यूल्स कहते हैं, वे जनन अंगों में इकट्ठा होते हैं। अरस्तू ने इसका विरोध किया था लेकिन कोई ठोस सबूत नहीं था। इसके अलावा प्रीफॉर्मेशन थ्योरी भी प्रचलित थी जिसमें माना जाता था कि शुक्राणु या अंडे के अंदर एक छोटा मानव पहले से मौजूद होता है जिसे होमुनकुलस कहते हैं। 1900 में जब मेंडल के कार्यों की दोबारा खोज ह्यूगो डी व्रीस और अन्य वैज्ञानिकों द्वारा की गई, तब पोस्ट-मेंडेलियन युग शुरू हुआ। इस युग में यह साफ हो गया कि आनुवंशिकता पार्टिकुलेट है यानी गुण मिलते नहीं बल्कि स्वतंत्र इकाइयों जिन्हें हम जीन कहते हैं, उनके द्वारा ट्रांसफर होते हैं। इसके बाद सटन और बोवेरी ने क्रोमोसोमल थ्योरी दी जिसने जेनेटिक्स को एक नया मोड़ दिया। आज के समय में हम मॉलिक्यूलर जेनेटिक्स में डीएनए और आरएनए के स्तर पर अध्ययन करते हैं जो मेंडल की बुनियादी सोच पर ही टिका है। विकासवाद और आनुवंशिकी के बीच के संबंधों को समझने के लिए यह कालखंड सबसे महत्वपूर्ण माना जाता है क्योंकि इसी ने आधुनिक जीव विज्ञान की नींव रखी।",
      "points": [
        "ब्लेंडिंग बनाम पार्टिकुलेट इनहेरिटेंस",
        "पेंजेनेसिस और प्रीफॉर्मेशन थ्योरी",
        "1900 में मेंडल के नियमों की पुनर्खोज"
      ],
      "diagram": ""
    },
    {
      "id": 2,
      "title": "Mendelian principles of heredity",
      "hindi": "आनुवंशिकता के मेंडेलियन सिद्धांत",
      "content": "ग्रेगर जोहान मेंडल को आनुवंशिकी का जनक कहा जाता है क्योंकि उन्होंने सबसे पहले आनुवंशिकता के नियमों को गणितीय आधार पर समझाया। उन्होंने मटर के पौधे पर 7 साल तक प्रयोग किए और तीन प्रमुख नियम दिए। पहला है प्रभाविता का नियम जिसमें बताया गया कि जब दो विपरीत लक्षण वाले पौधों का क्रॉस कराया जाता है तो पहली पीढ़ी में केवल एक ही प्रभावी लक्षण दिखता है। दूसरा है पृथक्करण का नियम जिसे युग्मकों की शुद्धता का नियम भी कहते हैं क्योंकि अर्धसूत्री विभाजन के समय एलील्स अलग हो जाते हैं और हर युग्मक में केवल एक ही एलील जाता है। तीसरा है स्वतंत्र अपव्यूहन का नियम जो बताता है कि जब दो या दो से ज्यादा लक्षणों का अध्ययन किया जाता है तो उनके जीन एक-दूसरे से स्वतंत्र रूप से अगली पीढ़ी में जाते हैं। मेंडल ने 3:1 का मोनोहाइब्रिड और 9:3:3:1 का डाईहाइब्रिड अनुपात दिया। हालांकि बाद में सहलग्नता और अपूर्ण प्रभाविता जैसे अपवाद मिले लेकिन मेंडल के ये नियम आज भी जेनेटिक्स का आधार हैं। इन नियमों की मदद से ही कृषि विज्ञानी फसलों की नई और उन्नत किस्में विकसित करने में सफल हो रहे हैं। यह सिद्धांत हमें यह भी समझाता है कि क्यों कुछ लक्षण पीढ़ियों तक छिपे रहते हैं और अचानक प्रकट हो जाते हैं।",
      "points": [
        "प्रभाविता का नियम",
        "पृथक्करण का नियम",
        "स्वतंत्र अपव्यूहन का नियम"
      ],
      "diagram": ""
    },
    {
      "id": 3,
      "title": "Cell division – mitosis",
      "hindi": "कोशिका विभाजन - समसूत्री विभाजन",
      "content": "समसूत्री विभाजन कोशिका विभाजन की वह प्रक्रिया है जो शरीर की कायिक कोशिकाओं में होती है। इसका मुख्य उद्देश्य शरीर की वृद्धि, विकास और टूटे-फूटे ऊतकों की मरम्मत करना है। समसूत्री विभाजन को समान विभाजन कहते हैं क्योंकि इसमें बनने वाली दो बेटी कोशिकाओं में गुणसूत्रों की संख्या उतनी ही होती है जितनी मातृ कोशिका में थी। इसकी चार प्रमुख अवस्थाएं हैं। प्रोफेज में क्रोमेटिन संघनित होकर गुणसूत्र बन जाते हैं और केंद्रक झिल्ली गायब होने लगती है। मेटाफेज में सारे गुणसूत्र कोशिका के बीच में एक रेखा में लग जाते हैं जिसे मेटाफेज प्लेट कहते हैं। एनाफेज में सिस्टर क्रोमैटिड्स अलग होकर विपरीत ध्रुवों की तरफ खिंचने लगते हैं। टेलोफेज में दोबारा केंद्रक झिल्ली बनने लगती है और कोशिका विभाजन पूरा होता है। इसके बाद साइटोकिनेसिस होता है जिसमें कोशिका द्रव्य अलग हो जाता है। जेनेटिक्स में समसूत्री विभाजन का महत्व यह है कि यह शरीर की हर कोशिका में समान आनुवंशिक सूचना बनाए रखता है। यदि इस प्रक्रिया में कोई त्रुटि हो जाए तो यह कैंसर जैसी गंभीर बीमारियों का कारण बन सकती है। यह प्रजनन और पुनर्जनन की बुनियादी इकाई है।",
      "points": [
        "समान विभाजन (2n से 2n)",
        "चरण: प्रोफेज, मेटाफेज, एनाफेज, टेलोफेज",
        "शारीरिक वृद्धि और आनुवंशिक स्थिरता में भूमिका"
      ],
      "diagram": "[attachment_0](attachment)"
    },
    {
      "id": 4,
      "title": "Cell division – meiosis",
      "hindi": "कोशिका विभाजन - अर्धसूत्री विभाजन",
      "content": "अर्धसूत्री विभाजन एक विशेष प्रकार का कोशिका विभाजन है जो सिर्फ जनन कोशिकाओं में युग्मक बनाने के लिए होता है। इसे न्यूनीकरण विभाजन कहते हैं क्योंकि इसमें गुणसूत्रों की संख्या आधी रह जाती है। अर्धसूत्री विभाजन दो चरणों में पूरा होता है: मियोसिस I और मियोसिस II। मियोसिस I की प्रोफेज I अवस्था सबसे लंबी और जटिल होती है जिसके पांच उप-चरण हैं: लेप्टोटीन, जाइगोटीन, पैचिटीन, डिप्लोटीन और डायकाइनेसिस। पैचिटीन अवस्था में क्रॉसिंग ओवर होता है जिसमें समजात गुणसूत्रों के बीच डीएनए का आदान-प्रदान होता है। इसी की वजह से प्रकृति में जैव विविधता बनी रहती है और संतानें अपने माता-पिता से थोड़ी भिन्न होती हैं। मियोसिस II बिल्कुल समसूत्री विभाजन की तरह होता है। इस विभाजन का सबसे बड़ा महत्व यह है कि यह लैंगिक प्रजनन के बाद गुणसूत्रों की संख्या को प्रजातियों में स्थिर बनाए रखता है। साथ ही यह आनुवंशिक पुनर्संयोजन का सबसे बड़ा स्रोत है जो जैव विकास (Evolution) में मदद करता है। पादप प्रजनन में ब्रीडर्स इसी प्रक्रिया का उपयोग करके वांछित गुणों वाले नए हाइब्रिड तैयार करते हैं।",
      "points": [
        "अर्धकारी विभाजन (2n से n)",
        "प्रोफेज I में क्रॉसिंग ओवर",
        "प्रजातियों में गुणसूत्र संख्या का संरक्षण"
      ],
      "diagram": ""
    },
    {
      "id": 5,
      "title": "Probability and Chi-square",
      "hindi": "प्रायिकता और काई-स्क्वायर",
      "content": "आनुवंशिकी एक ऐसा विज्ञान है जिसमें हम परिणामों का पूर्वानुमान लगाने के लिए सांख्यिकी का सहारा लेते हैं। प्रायिकता हमें बताती है कि किसी विशेष लक्षण के प्रकट होने की कितनी संभावना है। इसके दो मुख्य नियम हैं: योग का नियम और गुणन का नियम। जब दो घटनाएं एक-दूसरे से स्वतंत्र हों और उनके एक साथ होने की संभावना निकालनी हो तो गुणन नियम का उपयोग होता है। काई-स्क्वायर टेस्ट एक सांख्यिकीय उपकरण है जो जेनेटिक्स के प्रयोगों में बहुत महत्वपूर्ण है। यह परीक्षण हमें बताता है कि जो परिणाम हमें प्रयोग में मिले हैं (Observed) और जो हमने मेंडल के नियमों के अनुसार अपेक्षित किए थे (Expected), उनके बीच का अंतर कितना सार्थक है। यदि काई-स्क्वायर की गणना की गई वैल्यू टेबल वैल्यू से कम होती है, तो इसका मतलब है कि अंतर केवल संयोग है और हमारा प्रयोग मेंडेलियन अनुपात का पालन कर रहा है। यह टेस्ट डेटा की सटीकता और वैज्ञानिक वैधता की जांच करने के लिए सबसे ज्यादा उपयोग किया जाता है। कृषि अनुसंधान में नई किस्मों के परीक्षण के दौरान यह डेटा विश्लेषण का अनिवार्य हिस्सा है।",
      "points": [
        "आनुवंशिकता में प्रायिकता के नियम",
        "काई-स्क्वायर सूत्र और महत्व",
        "शून्य परिकल्पना (Null Hypothesis) का परीक्षण"
      ],
      "diagram": ""
    },
    {
      "id": 6,
      "title": "Dominance relationships and gene interaction",
      "hindi": "प्रभाविता संबंध और जीन अंतःक्रिया",
      "content": "मेंडल के नियमों के अनुसार एक एलील दूसरे पर पूरी तरह प्रभावी होता है, लेकिन प्रकृति में हमेशा ऐसा नहीं होता। प्रभाविता के विभिन्न संबंध होते हैं जैसे अपूर्ण प्रभाविता (Incomplete Dominance) जिसमें दोनों लक्षणों का मिश्रण दिखता है, जैसे मिराबिलिस जलापा में लाल और सफेद फूलों के क्रॉस से गुलाबी फूल मिलना। सह-प्रभाविता (Co-dominance) में दोनों एलील्स समान रूप से व्यक्त होते हैं, जैसे इंसानों में AB रक्त समूह। जीन अंतःक्रिया तब होती है जब दो या अधिक जीन मिलकर किसी एक लक्षण को प्रभावित करते हैं। यह अंतःक्रिया एलीलिक या नॉन-एलीलिक हो सकती है। कभी-कभी कुछ जीन इतने घातक होते हैं कि वे जीव की मृत्यु का कारण बन जाते हैं, जिन्हें घातक जीन (Lethal Genes) कहा जाता है। यह विषय हमें समझाता है कि जीन अकेले काम नहीं करते बल्कि एक जटिल नेटवर्क में काम करते हैं। इन अंतःक्रियाओं के कारण मेंडल के सरल 3:1 और 9:3:3:1 अनुपात बदल जाते हैं, जिससे नए और विविध लक्षण प्रारूप (Phenotypes) उत्पन्न होते हैं।",
      "points": [
        "अपूर्ण और सह-प्रभाविता",
        "एलीलिक और नॉन-एलीलिक अंतःक्रिया",
        "घातक जीन और उनके प्रभाव"
      ],
      "diagram": ""
    },
    {
      "id": 7,
      "title": "Epistatic gene interactions I",
      "hindi": "एपिस्टैटिक जीन अंतःक्रिया I",
      "content": "एपिस्टैसिस एक ऐसी घटना है जिसमें एक जीन लोक्स पर मौजूद एलील दूसरे लोक्स पर मौजूद जीन की अभिव्यक्ति को ढक देता है या बदल देता है। इसमें प्रमुख रूप से पूरक जीन (Complementary Genes), अनुपूरक जीन (Supplementary Genes) और डुप्लिकेट जीन अंतःक्रियाएं शामिल हैं। पूरक जीन अंतःक्रिया (9:7 अनुपात) में किसी लक्षण के प्रकट होने के लिए दो अलग-अलग जीन की उपस्थिति अनिवार्य होती है। अनुपूरक जीन (9:3:4 अनुपात) में एक जीन अपना प्रभाव स्वतंत्र रूप से दिखाता है लेकिन दूसरा केवल पहले की उपस्थिति में ही काम करता है। डुप्लिकेट जीन (15:1 अनुपात) में दो अलग-अलग जीन एक ही कार्य को स्वतंत्र रूप से कर सकते हैं। ये अंतःक्रियाएं दर्शाती हैं कि जैव रासायनिक मार्ग (Biochemical Pathways) कितने जटिल होते हैं और कैसे कई जीन मिलकर एक अंतिम उत्पाद बनाते हैं। पादप प्रजनन में इन अनुपातों की समझ बहुत महत्वपूर्ण है क्योंकि यह अनाज के रंग, दाने की बनावट और पौधों की अन्य विशेषताओं को नियंत्रित करते हैं।",
      "points": [
        "एपिस्टैसिस की परिभाषा",
        "पूरक जीन क्रिया (9:7)",
        "अनुपूरक और डुप्लिकेट जीन अनुपात"
      ],
      "diagram": "[Image explaining Epistasis biochemical pathway]"
    },
    {
      "id": 8,
      "title": "Epistatic gene interactions II",
      "hindi": "एपिस्टैटिक जीन अंतःक्रिया II",
      "content": "एपिस्टैसिस के दूसरे भाग में मास्किंग एपिस्टैसिस (12:3:1), निरोधात्मक जीन (13:3) और पॉलीमेरिक जीन क्रिया (9:6:1) जैसी महत्वपूर्ण अंतःक्रियाएं आती हैं। मास्किंग एपिस्टैसिस में एक प्रभावी जीन दूसरे जीन के प्रभाव को पूरी तरह छिपा देता है, चाहे वह प्रभावी हो या अप्रभावी। निरोधात्मक जीन अंतःक्रिया में एक जीन का मुख्य कार्य दूसरे जीन की अभिव्यक्ति को रोकना होता है। पॉलीमेरिक जीन क्रिया में दो जीन एक ही लक्षण को प्रभावित करते हैं और उनके संयुक्त प्रभाव से लक्षण की तीव्रता बढ़ जाती है। ये प्रक्रियाएं पौधों में पिगमेंटेशन, फल के आकार और रोग प्रतिरोधकता को समझने में मदद करती हैं। जेनेटिक्स के विद्यार्थियों के लिए इन संशोधित अनुपातों को समझना अनिवार्य है क्योंकि वास्तविक दुनिया में मेंडेलियन अनुपात के बजाय ये जटिल अनुपात अधिक पाए जाते हैं। यह ज्ञान हाइब्रिड बीजों के विकास और उनके गुणों के पूर्वानुमान लगाने में मदद करता है।",
      "points": [
        "प्रभावी एपिस्टैसिस (12:3:1)",
        "निरोधात्मक जीन क्रिया (13:3)",
        "पॉलीमेरिक जीन क्रिया (9:6:1)"
      ],
      "diagram": "[Image summarizing modified Mendelian ratios in epistasis]"
    },
    {
      "id": 9,
      "title": "Pleiotropism and Multiple alleles",
      "hindi": "प्लियोट्रोपिज्म और बहु-युग्मविकल्पी",
      "content": "प्लियोट्रोपिज्म वह स्थिति है जब एक ही जीन शरीर के कई अलग-अलग और असंबंधित लक्षणों को प्रभावित करता है। इसका एक उदाहरण सिकल सेल एनीमिया है जहाँ एक जीन में बदलाव से न केवल हीमोग्लोबिन बदलता है बल्कि शारीरिक कमजोरी और अन्य लक्षण भी आते हैं। दूसरी ओर, बहु-युग्मविकल्पी (Multiple Alleles) तब होता है जब एक ही जीन के दो से अधिक वैकल्पिक रूप होते हैं, जैसे मनुष्यों में ABO रक्त समूह प्रणाली जिसे तीन एलील्स (IA, IB, i) द्वारा नियंत्रित किया जाता है। स्यूडोएलील्स वे जीन होते हैं जो गुणसूत्र पर बहुत पास स्थित होते हैं और एक ही लक्षण को प्रभावित करते हैं, लेकिन क्रॉसिंग ओवर के माध्यम से वे अलग भी हो सकते हैं। यह विषय आनुवंशिक विविधता की गहराई को समझने में मदद करता है। कृषि में यह समझना जरूरी है कि कैसे एक जीन में बदलाव करने से पौधे की उपज के साथ-साथ उसकी गुणवत्ता पर भी प्रभाव पड़ सकता है।",
      "points": [
        "एक जीन के अनेक प्रभाव (प्लियोट्रोपिज्म)",
        "ABO रक्त समूह और बहु-युग्मविकल्पी",
        "स्यूडोएलील्स की अवधारणा"
      ],
      "diagram": ""
    },
    {
      "id": 10,
      "title": "Sex determination",
      "hindi": "लिंग निर्धारण",
      "content": "जीवों में लिंग निर्धारण की प्रक्रिया बहुत विविध है। मनुष्यों में XY तंत्र पाया जाता है जहाँ पुरुष विषमयुग्मजी (XY) और महिला समयुग्मजी (XX) होती है। पक्षियों में इसके विपरीत ZW तंत्र होता है जहाँ मादा विषमयुग्मजी होती है। कुछ कीटों में XO तंत्र होता है जहाँ लिंग गुणसूत्रों की संख्या से तय होता है। मधुमक्खियों में अगुणित-द्विगुणित (Haplodiploidy) तंत्र पाया जाता है जहाँ नर अगुणित और मादा द्विगुणित होती है। ड्रोसोफिला में ब्रिजेस ने जेनिक बैलेंस थ्योरी दी जिसमें लिंग का निर्धारण X गुणसूत्र और ऑटोसोम्स के सेट के बीच के अनुपात से होता है। कुछ सरीसृपों में तापमान जैसे पर्यावरणीय कारक लिंग तय करते हैं। लिंग निर्धारण की समझ न केवल जीव विज्ञान के लिए बल्कि पशुपालन और मत्स्य पालन जैसे क्षेत्रों में भी महत्वपूर्ण है जहाँ विशिष्ट लिंग के जीवों की अधिक मांग होती है।",
      "points": [
        "XY, ZW और XO तंत्र",
        "मधुमक्खियों में लिंग निर्धारण",
        "जेनिक बैलेंस थ्योरी"
      ],
      "diagram": ""
    },
    {
      "id": 11,
      "title": "Sex limited and sex linked traits",
      "hindi": "लिंग सीमित और लिंग सहलग्न लक्षण",
      "content": "लिंग सहलग्न (Sex-linked) लक्षण वे होते हैं जिनके जीन सेक्स गुणसूत्रों (मुख्यतः X) पर स्थित होते हैं, जैसे वर्णांधता और हीमोफिलिया। इनकी वंशागति का एक विशिष्ट पैटर्न होता है। लिंग सीमित (Sex-limited) लक्षण केवल एक लिंग में ही दिखाई देते हैं, भले ही उनके जीन दोनों में मौजूद हों, जैसे गायों में दूध उत्पादन या मुर्गों में कलगी। लिंग प्रभावित (Sex-influenced) लक्षण दोनों लिंगों में प्रकट हो सकते हैं लेकिन उनकी अभिव्यक्ति हार्मोनल वातावरण के कारण अलग होती है, जैसे पुरुषों में गंजापन जो प्रभावी होता है जबकि महिलाओं में अप्रभावी। इन लक्षणों का अध्ययन आनुवंशिक रोगों के निदान और पशु प्रजनन में बहुत महत्वपूर्ण है। यह हमें बताता है कि कैसे आनुवंशिक सूचनाएं लिंग के साथ जुड़कर अपना प्रभाव बदल लेती हैं।",
      "points": [
        "X-सहलग्न वंशागति",
        "लिंग सीमित बनाम लिंग प्रभावित",
        "हार्मोनल प्रभाव और जीन अभिव्यक्ति"
      ],
      "diagram": ""
    },
    {
      "id": 12,
      "title": "Sex linkage",
      "hindi": "लिंग सहलग्नता",
      "content": "लिंग सहलग्नता मुख्य रूप से X गुणसूत्र पर स्थित जीनों के साथ जुड़ी होती है। इसकी खोज टी.एच. मॉर्गन ने ड्रोसोफिला की सफेद आँखों वाले उत्परिवर्ती के अध्ययन के दौरान की थी। इसमें क्रिस-क्रॉस विरासत (Criss-cross Inheritance) देखी जाती है, जहाँ पिता से लक्षण पुत्री में और फिर पुत्री से नाती (Grandson) में स्थानांतरित होते हैं। Y-सहलग्न जीन (Holandric Genes) केवल पिता से पुत्र में जाते हैं क्योंकि Y गुणसूत्र केवल पुरुषों में होता है। यह अवधारणा हमें यह समझने में मदद करती है कि कुछ आनुवंशिक बीमारियाँ पुरुषों में अधिक क्यों पाई जाती हैं। चिकित्सा विज्ञान में इस ज्ञान का उपयोग परिवारों में आनुवंशिक रोगों के जोखिम का आकलन करने के लिए किया जाता है। लिंग सहलग्नता आनुवंशिक मानचित्रण (Genetic Mapping) में भी एक आधार का कार्य करती है।",
      "points": [
        "X और Y सहलग्नता",
        "क्रिस-क्रॉस वंशागति पैटर्न",
        "होलैंड्रिक जीन के उदाहरण"
      ],
      "diagram": ""
    },
    {
      "id": 13,
      "title": "Linkage and its estimation",
      "hindi": "सहलग्नता और उसका अनुमान",
      "content": "सहलग्नता वह स्थिति है जब एक ही गुणसूत्र पर स्थित जीन एक साथ वंशागत होने की प्रवृत्ति रखते हैं। यह मेंडल के स्वतंत्र अपव्यूहन के नियम का अपवाद है। लिंकेज की शक्ति जीनों के बीच की दूरी पर निर्भर करती है; जीन जितने पास होंगे, लिंकेज उतनी ही मजबूत होगी। इसे कपलिंग (Coupling) और रिपल्शन (Repulsion) चरणों के माध्यम से समझा जाता है। कपलिंग में प्रभावी एलील्स एक ही गुणसूत्र पर होते हैं, जबकि रिपल्शन में वे अलग-अलग गुणसूत्रों पर होते हैं। लिंकेज का अनुमान पुनर्संयोजन आवृत्ति (Recombination Frequency) के आधार पर लगाया जाता है। पादप प्रजनन में लिंकेज एक बड़ी चुनौती हो सकती है जब एक अच्छे गुण के साथ कोई हानिकारक गुण मजबूती से जुड़ा हो, जिसे लिंकेज ड्रैग कहते हैं। इसे तोड़ने के लिए बड़े पैमाने पर क्रॉसिंग ओवर की आवश्यकता होती है।",
      "points": [
        "स्वतंत्र अपव्यूहन का अपवाद",
        "कपलिंग और रिपल्शन चरण",
        "लिंकेज ड्रैग और उसका महत्व"
      ],
      "diagram": ""
    },
    {
      "id": 14,
      "title": "Crossing over: mechanism",
      "hindi": "क्रॉसिंग ओवर: तंत्र",
      "content": "अर्धसूत्री विभाजन की पैचिटीन अवस्था में समजात गुणसूत्रों के गैर-सिस्टर क्रोमैटिड्स के बीच डीएनए का आदान-प्रदान क्रॉसिंग ओवर कहलाता है। यह प्रक्रिया 'कियास्मा' निर्माण के माध्यम से होती है। क्रॉसिंग ओवर आनुवंशिक पुनर्संयोजन का मुख्य स्रोत है, जिससे संतानों में नए और विविध लक्षण उत्पन्न होते हैं। इसकी आवृत्ति जीनों के बीच की दूरी के समानुपाती होती है। क्रॉसिंग ओवर न केवल विविधता लाता है बल्कि यह गुणसूत्रों के उचित पृथक्करण के लिए भी आवश्यक है। जैव विकास की दृष्टि से यह सबसे महत्वपूर्ण घटना है क्योंकि इसी के कारण प्राकृतिक चयन के लिए नए विकल्प उपलब्ध होते हैं। कृषि क्षेत्र में वांछित गुणों के नए संयोजन बनाने के लिए क्रॉसिंग ओवर का ज्ञान अनिवार्य है।",
      "points": [
        "पैचिटीन अवस्था और कियास्मा",
        "आनुवंशिक पुनर्संयोजन का स्रोत",
        "दूरी और क्रॉसिंग ओवर का संबंध"
      ],
      "diagram": ""
    },
    {
      "id": 15,
      "title": "Chromosome mapping",
      "hindi": "गुणसूत्र मानचित्रण",
      "content": "गुणसूत्र मानचित्रण एक तकनीक है जिससे गुणसूत्र पर जीनों की सापेक्ष स्थिति और उनके बीच की दूरी का पता लगाया जाता है। यह इस सिद्धांत पर आधारित है कि क्रॉसिंग ओवर की आवृत्ति जीनों के बीच की दूरी को दर्शाती है। 1% पुनर्संयोजन को 1 सेंटीमॉर्गन (cM) की दूरी माना जाता है। इसके लिए 'थ्री-पॉइंट टेस्ट क्रॉस' सबसे सटीक विधि है, क्योंकि यह जीनों के सही क्रम और उनके बीच के हस्तक्षेप (Interference) को समझने में मदद करती है। आनुवंशिक मानचित्र आधुनिक जीनोमिक्स अनुसंधान का आधार हैं, जो विशेष रूप से फसल सुधार और आनुवंशिक रोगों के मार्कर ढूंढने में मदद करते हैं। यह वैज्ञानिकों को यह समझने में मदद करता है कि कौन से जीन एक साथ वंशागत हो सकते हैं।",
      "points": [
        "सेंटीमॉर्गन और मैप इकाइयाँ",
        "थ्री-पॉइंट टेस्ट क्रॉस",
        "जीन क्रम का निर्धारण"
      ],
      "diagram": "[Image showing construction of a genetic linkage map]"
    },
    {
      "id": 16,
      "title": "Structural changes in chromosome",
      "hindi": "गुणसूत्र में संरचनात्मक परिवर्तन",
      "content": "गुणसूत्रों की संरचना में होने वाले बड़े बदलावों को क्रोमोसोमल एबरेशन कहते हैं। इसमें विलोपन (Deletion) - जहाँ गुणसूत्र का हिस्सा गायब हो जाता है, दोहराव (Duplication) - जहाँ हिस्सा बढ़ जाता है, व्युत्क्रमण (Inversion) - जहाँ हिस्सा 180 डिग्री घूम जाता है, और स्थानांतरण (Translocation) - जहाँ गैर-समजात गुणसूत्रों के बीच हिस्सों का आदान-प्रदान होता है, शामिल हैं। ये परिवर्तन जीनों के संतुलन को बिगाड़ सकते हैं और अक्सर रोगों, बांझपन या गर्भपात का कारण बनते हैं। हालांकि, विकासवाद की दृष्टि से ये नए जीन समूहों के निर्माण में भी भूमिका निभाते हैं। कृषि विज्ञान में, इनका उपयोग कभी-कभी वांछित गुणों को स्थानांतरित करने या नर बंध्यता पैदा करने के लिए किया जाता है। इन परिवर्तनों को माइक्रोस्कोप के नीचे साइटोलॉजिकल अध्ययन द्वारा पहचाना जा सकता है।",
      "points": [
        "विलोपन और दोहराव",
        "व्युत्क्रमण (पैरासेंट्रिक और पेरीसेंट्रिक)",
        "स्थानांतरण और उसके प्रभाव"
      ],
      "diagram": "[attachment_1](attachment)"
    },
    {
      "id": 17,
      "title": "Numerical changes in chromosome",
      "hindi": "गुणसूत्र में संख्यात्मक परिवर्तन",
      "content": "गुणसूत्रों की संख्या में परिवर्तन दो प्रकार का होता है: एन्यूप्लोइडी और यूप्लोइडी। एन्यूप्लोइडी में एक या दो गुणसूत्रों की कमी या अधिकता होती है (जैसे ट्राइसोमी या मोनोसोमी)। यूप्लोइडी या पॉलीप्लोइडी में गुणसूत्रों के पूरे सेट की संख्या बढ़ जाती है (जैसे 3n, 4n)। पौधों में पॉलीप्लोइडी बहुत सामान्य और फायदेमंद है; अधिकांश आधुनिक फसलें जैसे गेहूं और गन्ना पॉलीप्लोइड हैं। इससे पौधों का आकार, फल की गुणवत्ता और सहनशीलता बढ़ती है। इंसानों में संख्यात्मक परिवर्तन अक्सर गंभीर सिंड्रोम का कारण बनते हैं, जैसे डाउन सिंड्रोम। यह विषय आनुवंशिक स्थिरता और प्रजातियों के विकास को समझने के लिए मौलिक है। पादप प्रजनक अक्सर रसायनों (जैसे कोल्चिसिन) का उपयोग करके कृत्रिम रूप से पॉलीप्लोइडी प्रेरित करते हैं।",
      "points": [
        "एन्यूप्लोइडी बनाम यूप्लोइडी",
        "पॉलीप्लोइडी के लाभ (जैसे गीगास प्रभाव)",
        "कोल्चिसिन का उपयोग"
      ],
      "diagram": "[Image explaining aneuploidy and polyploidy]"
    },
    {
      "id": 18,
      "title": "Mutation: Introduction and Classification",
      "hindi": "उत्परिवर्तन: परिचय और वर्गीकरण",
  "content": "उत्परिवर्तन डीएनए अनुक्रम में होने वाला अचानक और स्थायी परिवर्तन है जो वंशागत हो सकता है। इसकी खोज ह्यूगो डी व्रीस ने की थी। उत्परिवर्तन जैव विविधता और विकास का प्राथमिक स्रोत हैं। इन्हें स्वतः (Spontaneous) - जो प्रकृति में अपने आप होते हैं, और प्रेरित (Induced) - जो रसायनों या विकिरण द्वारा पैदा किए जाते हैं, में बांटा जा सकता है। आणविक स्तर पर ये पॉइंट म्यूटेशन (एक बेस का बदलाव) या फ्रेमशिफ्ट म्यूटेशन हो सकते हैं। अधिकांश उत्परिवर्तन हानिकारक होते हैं, लेकिन कुछ लाभकारी उत्परिवर्तन फसलों में रोग प्रतिरोधकता और उच्च उपज जैसे गुण लाते हैं। म्यूटेशन ब्रीडिंग एक महत्वपूर्ण तकनीक है जिससे नई किस्में विकसित की जाती हैं। यह विज्ञान का वह क्षेत्र है जो आनुवंशिक सुधार की असीमित संभावनाएं प्रदान करता है।",
      "points": [
        "अचानक और स्थायी परिवर्तन",
        "स्वतः बनाम प्रेरित उत्परिवर्तन",
        "पॉइंट और फ्रेमशिफ्ट म्यूटेशन"
      ],
      "diagram": ""
    },
    {
      "id": 19,
      "title": "Mutagenic agents",
      "hindi": "उत्परिवर्तजन कारक",
      "content": "वे कारक जो उत्परिवर्तन की दर को बढ़ाते हैं, म्यूटाजेंस कहलाते हैं। ये दो प्रकार के होते हैं: भौतिक और रासायनिक। भौतिक म्यूटाजेंस में आयनकारी विकिरण (X-रे, गामा किरणें) और गैर-आयनकारी विकिरण (UV किरणें) शामिल हैं। रासायनिक म्यूटाजेंस में EMS, मस्टर्ड गैस और बेस एनालॉग्स जैसे पदार्थ आते हैं। इनका उपयोग प्रयोगशालाओं में पौधों की आनुवंशिक संरचना को बदलने के लिए किया जाता है। गामा गार्डन का उपयोग पौधों को गामा विकिरण के संपर्क में लाने के लिए किया जाता है। म्यूटाजेंस के उपयोग के दौरान सुरक्षा प्रोटोकॉल बहुत महत्वपूर्ण हैं क्योंकि ये मनुष्यों के लिए भी घातक हो सकते हैं। कृषि क्षेत्र में, इन कारकों की मदद से ऐसी फसलें तैयार की गई हैं जो जलवायु परिवर्तन और कीटों के प्रति अधिक सहनशील हैं।",
      "points": [
        "भौतिक म्यूटाजेंस (विकिरण)",
        "रासायनिक म्यूटाजेंस के प्रकार",
        "म्यूटेशन ब्रीडिंग में उपयोग"
      ],
      "diagram": ""
    },
    {
      "id": 20,
      "title": "CIB technique",
      "hindi": "CIB तकनीक",
      "content": "CIB तकनीक का विकास एच. जे. मुलर ने ड्रोसोफिला (फल मक्खी) में घातक उत्परिवर्तन की दर को मापने के लिए किया था। यहाँ C का अर्थ 'क्रॉसिंग ओवर सप्रेसर', I का अर्थ 'रिसेसिव लीथल' (घातक जीन), और B का अर्थ 'बार आई' (Bar eye) मार्कर है। यह तकनीक विशेष रूप से X गुणसूत्र पर होने वाले उत्परिवर्तनों का पता लगाने के लिए डिज़ाइन की गई थी। मुलर के इस कार्य ने यह साबित किया कि विकिरण से उत्परिवर्तन पैदा किए जा सकते हैं, जिसके लिए उन्हें नोबेल पुरस्कार मिला। यह तकनीक आनुवंशिकी के इतिहास में मील का पत्थर है क्योंकि इसने उत्परिवर्तन दर के सटीक मापन का मार्ग प्रशस्त किया। आज भी यह आनुवंशिक अनुसंधान के बुनियादी सिद्धांतों को समझाने के लिए एक उत्कृष्ट उदाहरण है।",
      "points": [
        "एच. जे. मुलर का योगदान",
        "घातक उत्परिवर्तन का पता लगाना",
        "ड्रोसोफिला में C, I और B के कार्य"
      ],
      "diagram": ""
    },
    {
      "id": 21,
      "title": "Qualitative and Quantitative traits",
      "hindi": "गुणात्मक और मात्रात्मक लक्षण",
      "content": "लक्षणों को दो श्रेणियों में बांटा गया है। गुणात्मक (Qualitative) लक्षण वे हैं जो स्पष्ट श्रेणियों में होते हैं (जैसे फूल का रंग - लाल या सफेद) और एक या दो जीनों द्वारा नियंत्रित होते हैं। मात्रात्मक (Quantitative) लक्षण वे हैं जो निरंतर भिन्नता दिखाते हैं और जिन्हें मापा जा सकता है (जैसे ऊंचाई, वजन, उपज)। मात्रात्मक लक्षणों को पॉलीजीन (कई जीन) नियंत्रित करते हैं और इन पर पर्यावरण का प्रभाव बहुत अधिक होता है। अधिकांश आर्थिक रूप से महत्वपूर्ण कृषि लक्षण जैसे अनाज की उपज मात्रात्मक होते हैं। इनका अध्ययन करने के लिए जटिल सांख्यिकीय विधियों की आवश्यकता होती है। यह समझना महत्वपूर्ण है कि कैसे कई छोटे-छोटे जीनों का प्रभाव जुड़कर एक बड़ा परिणाम देता है। प्रजनकों के लिए मात्रात्मक आनुवंशिकी का ज्ञान फसल सुधार के लक्ष्यों को प्राप्त करने के लिए अनिवार्य है।",
      "points": [
        "ओलिगोजीन बनाम पॉलीजीन",
        "निरंतर भिन्नता (Continuous Variation)",
        "पर्यावरण का प्रभाव और विरासत"
      ],
      "diagram": ""
    },
    {
      "id": 22,
      "title": "Multiple factor hypothesis",
      "hindi": "बहु-कारक परिकल्पना",
      "content": "निल्सन-एहले ने गेहूँ के दाने के रंग पर अपने प्रयोगों के आधार पर बहु-कारक परिकल्पना प्रस्तुत की। उन्होंने बताया कि मात्रात्मक लक्षण कई स्वतंत्र जीनों के संचयी प्रभाव (Additive Effect) का परिणाम होते हैं। प्रत्येक जीन का प्रभाव छोटा होता है, लेकिन वे मिलकर एक पूर्ण श्रेणीबद्ध भिन्नता पैदा करते हैं। यह परिकल्पना स्पष्ट करती है कि क्यों दो पौधों के क्रॉस से संतानों में रंगों या आकार की एक पूरी रेंज मिलती है न कि केवल दो श्रेणियाँ। यह मात्रात्मक आनुवंशिकी का आधार है और आधुनिक फसल सुधार कार्यक्रमों की नींव है। यह हमें यह भी समझाता है कि क्यों कुछ संताने अपने माता-पिता से भी बेहतर (Transgressive Segregants) हो सकती हैं। सांख्यिकीय रूप से, इन लक्षणों को सामान्य वितरण वक्र (Normal Distribution Curve) द्वारा दर्शाया जाता है।",
      "points": [
        "निल्सन-एहले का प्रयोग",
        "जीनों का संचयी प्रभाव",
        "मात्रात्मक आनुवंशिकी का आधार"
      ],
      "diagram": ""
    },
    {
      "id": 23,
      "title": "Cytoplasmic inheritance",
      "hindi": "कोशिकाद्रव्यी वंशागति",
      "content": "कोशिकाद्रव्यी वंशागति तब होती है जब लक्षण केंद्रक के बाहर स्थित डीएनए (माइटोकॉन्ड्रिया या क्लोरोप्लास्ट) द्वारा नियंत्रित होते हैं। चूंकि निषेचन के समय सारा कोशिका द्रव्य माता के अंडे से आता है, इसलिए ये लक्षण केवल माता से ही संतान में जाते हैं, जिसे मातृ वंशागति (Maternal Inheritance) कहते हैं। इसका सबसे महत्वपूर्ण कृषि उपयोग साइटोप्लाज्मिक मेल स्टेरिलिटी (CMS) है। CMS का उपयोग हाइब्रिड बीजों के बड़े पैमाने पर उत्पादन में किया जाता है क्योंकि यह पौधों में स्वतः परागण को रोकता है और हस्त-नपुंसकीकरण (Emasculation) की आवश्यकता को समाप्त करता है। यह विषय हमें बताता है कि आनुवंशिकता केवल गुणसूत्रों तक सीमित नहीं है। माइटोकॉन्ड्रियल डीएनए में बदलाव कई ऊर्जा संबंधी रोगों से भी जुड़े होते हैं।",
      "points": [
        "अतिरिक्त-केंद्रकीय वंशागति",
        "मातृ वंशागति पैटर्न",
        "नर बंध्यता (CMS) और हाइब्रिड बीज"
      ],
      "diagram": ""
    },
    {
      "id": 24,
      "title": "Genetic disorders",
      "hindi": "आनुवंशिक विकार",
      "content": "आनुवंशिक विकार जीनों या गुणसूत्रों में त्रुटियों के कारण होने वाली बीमारियाँ हैं। इन्हें दो भागों में बांटा जा सकता है: मेंडेलियन विकार (जैसे सिकल सेल एनीमिया, थैलेसेमिया) जो एकल जीन में उत्परिवर्तन से होते हैं, और गुणसूत्र विकार (जैसे डाउन सिंड्रोम, क्लिनफेल्टर सिंड्रोम) जो गुणसूत्रों की संख्या या संरचना में बदलाव से होते हैं। वंशावली विश्लेषण (Pedigree Analysis) का उपयोग परिवारों में इन रोगों के संचरण के पैटर्न को समझने के लिए किया जाता है। आनुवंशिक परामर्श (Genetic Counseling) आज एक अनिवार्य सेवा है जो जोड़ों को भविष्य में होने वाली संतानों में रोगों के जोखिम के बारे में जानकारी देती है। आधुनिक चिकित्सा में जीन थेरेपी इन विकारों को जड़ से खत्म करने की एक उभरती हुई तकनीक है। यह विषय न केवल वैज्ञानिक दृष्टि से बल्कि सामाजिक और नैतिक दृष्टि से भी अत्यंत महत्वपूर्ण है।",
      "points": [
        "मेंडेलियन और गुणसूत्र विकार",
        "वंशावली विश्लेषण का महत्व",
        "आनुवंशिक परामर्श और उपचार"
      ],
      "diagram": ""
    }
  ]
    }
